In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'D':[1,2,np.nan],
                  'A':[5,np.nan,7],
                  'R':[1,2,np.nan]})
df

     D    A    R
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  7.0  NaN

In [5]:
df.isnull().sum()

D    1
A    1
R    1
dtype: int64

In [6]:
df.dropna(thresh=2)

     D    A    R
0  1.0  5.0  1.0
1  2.0  NaN  2.0

In [7]:
df.dropna()

     D    A    R
0  1.0  5.0  1.0

In [8]:
age = [34,36,37,35,38,36,35]
np.median(age)

36.0

In [9]:
df.fillna(np.mean(df))

     D    A    R
0  1.0  5.0  1.0
1  2.0  3.0  2.0
2  3.0  7.0  3.0

In [18]:
#Operations
import numpy as np
import pandas as pd
df = pd.DataFrame({'A':[1,2,3,np.nan],
                  'B':[33,66,88,33],
                  'C':["ab","gh","pq","xy"]})
                  
df

     A   B   C
0  1.0  33  ab
1  2.0  66  gh
2  3.0  88  pq
3  NaN  33  xy

In [19]:
df['B'].unique()

array([33, 66, 88], dtype=int64)

In [20]:
df['B'].nunique()

3

In [22]:
df['B'].value_counts()

B
33    2
66    1
88    1
Name: count, dtype: int64

In [23]:
df.sum()

A         6.0
B         220
C    abghpqxy
dtype: object